Autodesk.Navisworks.Api.View.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32)
Generates an Image for this View.

Autodesk.Navisworks.Api.View.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Double)
Generates an Image for this View.

Autodesk.Navisworks.Api.View.PickItemFromPoint(System.Int32,System.Int32,System.Int32,System.Boolean)
Picks a single item from the given window coordinate point.
pickingWidth:
Width of picking region in pixels. Normally 1.
asRendered:
Whether picking should operate only on items that were rendered during the last frame. Normally true.
Returns:
A PickItemResult object that contains the picked item.
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemFromRectangle(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Picks a single item from the given window coordinate rectangle.
asRendered:
Whether picking should operate only on items that were rendered during the last frame. Normally true.
Returns:
A PickItemResult object that contains the picked item
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.StereoViewpointCalculated
Occurs when a stereo camera is calculated from a base camera.